{
    "wash clothes": "Explanation: I would go to the laundry room and find the washing machine. I would put my clothes in the washing machine, add detergent, and start the machine. Once the cycle is done, I would take my clothes out of the machine and put them in the dryer. I would set the dryer for the appropriate time and start it. Once the cycle is done, I would take my clothes out of the dryer and put them away.\n\nPlan: 1. walk to laundry room 2. find washing machine 3. put clothes in washing machine 4. add detergent 5. start washing machine 6. wait for cycle to finish 7. take clothes out of washing machine 8. put clothes in dryer 9. set dryer for appropriate time 10. start dryer 11. wait for cycle to finish 12. take clothes out of dryer 13. put clothes away 14. Done",
    "put apple in fridge": "1. Go to the kitchen.\n2. Find the fridge.\n3. Open the fridge.\n4. Find the apple.\n5. Put the apple in the fridge.\n6. Close the fridge.\n7. Done.",
    "make toast": "1. Find the toaster.\n2. Place a slice of bread in the toaster.\n3. Turn on the toaster.\n4. Wait for the toast to pop up.\n5. Remove the toast from the toaster.\n6. Spread butter or margarine on the toast, if desired.\n7. Add jelly, honey, or other toppings, if desired.\n8. Enjoy!",
    "wash mug": "Explanation: I would go to the kitchen and find the sink. Then I would turn on the faucet and put the mug under the water. Then I would grab the dishwashing liquid and put some on the mug. Then I would grab the washingsponge and start scrubbing the mug. After I'm done scrubbing, I would rinse the mug off with water and then dry it with a towel.\nPlan: 1. walk to kitchen  2. find sink 3. turn on faucet 4. put mug under water 5. grab dishwashing liquid 6. put dishwashing liquid on mug 7. grab washingsponge 8. start scrubbing mug 9. rinse mug off with water 10. dry mug with towel 11. Done",
    "put clothes in closet": "Explanation: I would go to the bedroom and find the closet. Then I would find the clothes that I want to put in the closet. After that, I would put the clothes in the closet.\nPlan: 1. walk to bedroom 2. find closet 3. find clothes 4. put clothes in closet 5. Done"
}